// 표현력 -> 관찰력 -> 상상력 -> 의사소통능력 -> 이해력 -> 공감능력 -> 자기 객관화 능력

export interface abliltyType {
  [key: string]: {
    id: number;
    name: string;
    contents: string[];
    englishName: string;
  };
}

export const abilityLists: abliltyType = {
  Expressiveness: {
    id: 1,
    name: "표현력",
    englishName: "Expressiveness",
    contents: [
      "생각, 느낌, 감정 등을 언어나 몸짓 등의 행위나 어떠한 재료를 변형하여 나타내는 능력입니다.",
      "표현에 사용할 신체적 능력이나 재료에 대한 공부와 이를 활용하기 위한 신체적, 정신적 기능과 기교를 익혀야 합니다.",
      "학습을 유도하고 기능과 기교를 향상시키기 위한 욕구를 가져야 전문가 수준의 능력을 가질 가능성이 있습니다.",
      "자신의 능력 향상을 위해 주변에 도움을 요청하고 받는 방법을 알아야합니다.",
    ],
  },
  Observation: {
    id: 2,
    name: "관찰력",
    englishName: "Observation",
    contents: [
      "사물이나 현상을 주의하여 자세히 살펴 보는 능력입니다.",
      "능력 향상을 위해서는 우선 오감과 활동을 통한 다양한 감각을 통한 인지 경험을 쌓아야 합니다.",
      "인지한 대상을 경험을 활용해 판단하기에 여러 활동을 경험해야 합니다.",
      "다양한 사고방식을 통하여 새롭게 접근 할 수 있도록 여러 사고방식을 학습할 필요가 있습니다.",
      "일상적인 대상에서 중요한 사실을 찾아내야 하기에, 참을성을 길러야 합니다.",
    ],
  },
  Imagination: {
    id: 3,
    name: "상상력",
    englishName: "Imagination",
    contents: [
      "지식이나 경험 등의 새로운 연결이나 다양한 조사 활동을 통한 문제해결을 경험할 필요가 있습니다.",
      "모순적인 상황이나 갈등 상황을 해결하고 이를 통하여 아이디어를 만들어가는 경험이 큰 영향을 줄 수 있습니다.",
      "은유적인 표현을 해석하고 여러 생각을 구체적으로 시각, 청각 등으로 느낄 수 있는 매체로 표현하는 경험을 할 수 있다면 좋습니다.",
      "마인드 맵이나 브레인스토밍 등 사고의 방향을 다양화하는 활동이 도움이 될 수 있습니다.",
    ],
  },
  Communication: {
    id: 4,
    name: "의사소통능력",
    englishName: "Communication",
    contents: [
      "소통 방법에 따른 지식과 사용법 이를 활용하기 위한 태도를 갖추면 좋습니다. 이를 위하여 다양한 소통방법과 다양한 소통대상을 접할 필요가 있습니다.",
      "소통할 개인이나 문화의 규범, 가치, 신념과 행동양식을 이해하고 공부할 필요가 있습니다. 다양한 문화에 대한 지식을 갖는다면 도움이 될 것입니다.",
      "내용의 요점을 파악하는 능력을 키워야 합니다.",
      "상황에 맞게 전략적으로 내용을 전달 할 수 있는 방법을 익힌다면 도움이 될 것입니다.",
    ],
  },
  Understanding: {
    id: 5,
    name: "이해력",
    englishName: "Understanding",
    contents: [
      "다양한 경험과 지식을 가진다면 훌륭한 능력 향상의 기틀이 잡힐 수 있습니다.",
      "새로운 경험과 지식을 받아드릴 때 기존 자신이 가지고 있던 경험과 지식을 연결 짓는 방법들을 경험한다면 능력이 향상될 수 있습니다.",
      "아동의 발달단계에서 지적 발달 수준에 맞추어 효과적인 새로운 경험을 갖게 한다면 아동 스스로의 이해 도식을 발달 시키는데 도움이 될 수 있습니다.",
      "자발적인 탐구 과정이 있다면 보다 효율적으로 지식을 습득할 수 잇기 때문에, 아동 스스로 탐구할 수 있도록 지원해줄 필요가 있습니다.",
    ],
  },
  Empathy: {
    id: 6,
    name: "공감능력",
    englishName: "Empathy",
    contents: [
      "여러 또래 친구와의 다양한 상호작용을 한다면 튼튼한 성장 기반을 가지게 될 수 있습니다.",
      "다른 종류의 상호작용이 있더라도 상호작용의 중간 매체가 다양해야 능력이 성장할 가능성이 큽니다.",
      "연령별 시기별 발생하는 욕구가 만족되어야, 타인의 욕구와 이에 대한 행동에 대해서 더 쉽게 공감할 수 있습니다.",
      "소통능력이 발달한다면 함께 성장할 가능성이 있습니다.",
    ],
  },
  SelfObjectification: {
    id: 7,
    name: "자기객관화능력",
    englishName: "SelfObjectification",
    contents: [
      "자신의 행동에 대한 통찰력이나 스스로를 비판적으로 볼 수. 있는 능력을 말합니다.",
      "성공한 경험을 얻었을 때, 발생하는 과한 자신감이나 실패의 과한 좌절감에서 벗어나기 위해 스스로를 인지해야 합니다.",
      "자신이 처한 상황을 유머 있게 표현해보는 경험을 한다면 도움이 될 수 있습니다.",
      "스스로 빠져드는 감정과 생각을 표현하고 이를 주변에 나누는 경험을 한다면 차후 도움이 될 수 있습니다.",
    ],
  },
};
