export const finalQuestions = [
  {
    id: 1,
    type: "R",
    jobs: "기술자, 비행기 조종사, 농부, 군인, 경찰, 소방관, 운동선수 등",
  },
  {
    id: 2,
    type: "I",
    jobs: "언어학자, 심리학자, 물리학자, 생물학자, 경영분석가, 연구원 등",
  },
  {
    id: 3,
    type: "A",
    jobs: "화가, 디자이너, 웹툰 작가, 소설 작가, 시나리오 작가, 영화감독 등",
  },
  {
    id: 4,
    type: "S",
    jobs: "교사, 강사, 간호사, 종교지도자, 상담가, 사회복지사, 언어치료사 등",
  },
  {
    id: 5,
    type: "E",
    jobs: "기업경영인, 정치가, 판사, 검사, 변호사, 연출가, 회사원 등",
  },
  {
    id: 6,
    type: "C",
    jobs: "공무원, 회사원, 회계사, 세무사, 감사원, 안전관리사, 사서, 법무사  등",
  },
];
